#pragma once
#include <iostream>
using namespace std;
class Info {
	int choise = 0;
public:
	void print()
	{
		cout << "Вікторина" << endl;
		cout << "														"<< endl;
		cout << "Про гру: вид гри, що полягає у відповідях на запитання з різних галузей знань " << endl;
		cout << "														"<<endl;
		cout << "		Правила гри:		" << endl;
		cout << "														"<< endl;
		cout << "1. Всього галузей знаь є 4" << endl;
		cout << "2. Кожне питання має рівень складності, к-сть балів за правильну відповідь на них буде різною" << endl;
		cout << "3. В кінці пройденої вікторини ви зможете подивитись набрану к - сть балів, та максимально можливу к - сть балів" << endl;
		cout << "4. В розділі 'прогрес' ви зможете подивитись завершені вами вікторини та к-сть балів набраних за них " << endl;
		cout << "														" << endl;
		cout << "Оберіть дію" << endl;
		cout << "1. Обрати розділ знать"<<endl;
		cout << "2. Прогрес"<<endl;
		cout << "3. Вийти з програми" << endl;
		cin >> choise;
		switch (choise) {
		case 1:
		case 2:
		case 3:
			cout << "ви обрали вийти з програми"<<endl;
			cout << "щоб закрити консоль натисність enter ";
			break;
		default:
			cout << "ви обрали невірну дію"<<endl;
		cin >> choise;
		}
	}
};
